rednblkx/HomeKey-ESP32/managed_components/espressif__esp_secure_cert_mgr/srcs/esp_secure_cert_tlv_read.c
/*
 * SPDX-FileCopyrightText: 2022 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <string.h>
#include "esp_log.h"
#include "esp_err.h"
#include "esp_partition.h"
#include "esp_crc.h"
#include "inttypes.h"

#if __has_include("esp_idf_version.h")
#include "esp_idf_version.h"

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)
#include "esp_random.h"
#else
#include "esp_system.h"
#endif

#include "esp_rom_sys.h"
#include "esp_efuse.h"
#include "esp_efuse_table.h"
#include "soc/soc_caps.h"
#include "esp_fault.h"
#include "esp_heap_caps.h"

#include "mbedtls/gcm.h"
#include "mbedtls/sha256.h"
#include "mbedtls/ecdsa.h"
#include "mbedtls/pk.h"
#include "mbedtls/version.h"

#include "esp_secure_cert_read.h"
#include "esp_secure_cert_tlv_config.h"
#include "esp_secure_cert_tlv_read.h"
#include "esp_secure_cert_tlv_private.h"
#include "esp_secure_cert_crypto.h"

#if SOC_HMAC_SUPPORTED
#include "esp_hmac.h"
#endif

#if (MBEDTLS_VERSION_NUMBER < 0x03000000)
/* mbedtls 2.x backward compatibility */
#define MBEDTLS_2X_COMPAT 1
/**
 * Mbedtls-3.0 forward compatibility
 */
#ifndef MBEDTLS_PRIVATE
#define MBEDTLS_PRIVATE(member) member
#endif
#endif /* (MBEDTLS_VERSION_NUMBER < 0x03000000) */

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include "spi_flash_mmap.h"
#include "esp_memory_utils.h"
#include "entropy_poll.h"
#else
#include "mbedtls/entropy_poll.h"
#include "soc/soc_memory_layout.h"
#endif

#endif

static const char *TAG = "esp_secure_cert_tlv";

#define MIN_ALIGNMENT_REQUIRED 16


#if SOC_HMAC_SUPPORTED
static esp_err_t esp_secure_cert_hmac_based_decryption(char *in_buf, uint32_t len, char *output_buf);
static esp_err_t esp_secure_cert_gen_ecdsa_key(esp_secure_cert_tlv_subtype_t subtype, char *output_buf, size_t buf_len);
#define ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE  121
#endif

/* This is the mininum required flash address alignment in bytes to write to an encrypted flash partition */

/*
 * Map the entire esp_secure_cert partition
 * and return the virtual address.
 *
 * @note
 * The mapping is done only once and function shall
 * simply return same address in case of successive calls.
 **/
const void *esp_secure_cert_get_mapped_addr(void)
{
    // Once initialized, these variable shall contain valid data till reboot.
    static const void *esp_secure_cert_mapped_addr;
    if (esp_secure_cert_mapped_addr) {
        return esp_secure_cert_mapped_addr;
    }

    esp_partition_iterator_t it = esp_partition_find(ESP_SECURE_CERT_TLV_PARTITION_TYPE,
                                  ESP_PARTITION_SUBTYPE_ANY, ESP_SECURE_CERT_TLV_PARTITION_NAME);
    if (it == NULL) {
        ESP_LOGE(TAG, "Partition not found.");
        return NULL;
    }

    const esp_partition_t *partition = esp_partition_get(it);
    if (partition == NULL) {
        ESP_LOGE(TAG, "Could not get partition.");
        return NULL;
    }

    /* Encrypted partitions need to be read via a cache mapping */
    spi_flash_mmap_handle_t handle;
    esp_err_t err;

    /* Map the entire partition */
    err = esp_partition_mmap(partition, 0, partition->size, SPI_FLASH_MMAP_DATA, &esp_secure_cert_mapped_addr, &handle);
    if (err != ESP_OK) {
        return NULL;
    }
    return esp_secure_cert_mapped_addr;
}

/*
 * Get the padding length applicable for the given TLV
 *
 * @input   The pointer to the start of the TLV (TLV Header)
 * @note    The padding length is defined in the design of the TLV.
 *          It says that each TLV data entry should be a multiple of MIN_ALIGNMENT_REQUIRED
 *          The actual tlv data is automatically padded to the nearest multiple of MIN_ALIGNMENT_REQUIRED
 */
static uint8_t esp_secure_cert_get_padding_length(esp_secure_cert_tlv_header_t *tlv_header)
{
    return ((MIN_ALIGNMENT_REQUIRED - (tlv_header->length % MIN_ALIGNMENT_REQUIRED)) % MIN_ALIGNMENT_REQUIRED);
}

/*
 * Get the total length of the TLV pointed by tlv_header
 * @input
 * tlv_header   The pointer to the start of the TLV (TLV Header)
 *
 * @note
 *          The total length of the TLV consists of following parts
 *          1) TLV Header
 *          2) TLV data
 *          3) Padding
 *          4) TLV footer
 *
 *          It is ensured by design that this length shall always be a multiple of MIN_ALIGNMENT_REQUIRED
 *
 */
static uint16_t esp_secure_cert_get_tlv_total_length(esp_secure_cert_tlv_header_t *tlv_header)
{
    uint16_t padding_length = esp_secure_cert_get_padding_length(tlv_header);
    uint16_t total_length = sizeof(esp_secure_cert_tlv_header_t) + tlv_header->length + padding_length + sizeof(esp_secure_cert_tlv_footer_t);
    return total_length;
}

/*
 * Verify the TLV integrity
 *
 * @input
 * tlv_header   The pointer to the start of the TLV (TLV header)
 *
 * @note
 *      This API calculates the crc value of header + tlv_data + padding
 *      This value is compared with the value stored in the TLV footer.
 *
 * @return
 *      True    TLV integrity verified
 *      False   TLV intefrity could not be verified
 */
static bool esp_secure_cert_verify_tlv_integrity(esp_secure_cert_tlv_header_t *tlv_header)
{
    ESP_LOGD(TAG, "Verifying the TLV integrity");
    if (!(tlv_header->magic == ESP_SECURE_CERT_TLV_MAGIC)) {
        return false;
    }

    uint8_t padding_length = esp_secure_cert_get_padding_length(tlv_header);
    ESP_LOGD(TAG, "Padding length obtained = %u", padding_length);
    size_t crc_data_len = sizeof(esp_secure_cert_tlv_header_t) + tlv_header->length + padding_length;
    uint32_t data_crc = esp_crc32_le(UINT32_MAX, (const uint8_t * )tlv_header, crc_data_len);
    esp_secure_cert_tlv_footer_t *tlv_footer = (esp_secure_cert_tlv_footer_t *)((void*)tlv_header + crc_data_len);
    if (tlv_footer->crc != data_crc) {
        ESP_LOGD(TAG, "Calculated crc = %04X does not match with crc"
                 " read from esp_secure_cert partition = %04X", (unsigned int)data_crc, (unsigned int)tlv_footer->crc);
        return false;
    }
    return true;
}

/*
 * Find the offset of tlv structure of given type in the esp_secure_cert partition
 *
 * Note: This API also validates the crc of the respective tlv before returning the offset
 * @input
 * esp_secure_cert_addr     Memory mapped address of the esp_secure_cert partition
 * type                     Type of the tlv structure.
 *                          for calculating current crc for esp_secure_cert
 * subtype                  Subtype of the given tlv structure. If subtype is given as ESP_SECURE_CERT_SUBTYPE_MAX then the entry with highest value of subtype is given as output
 *
 * tlv_address              Void pointer to store tlv address
 *
 */
esp_err_t esp_secure_cert_find_tlv(const void *esp_secure_cert_addr, esp_secure_cert_tlv_type_t type, uint8_t subtype, void **tlv_address)
{
    /* start from the begining of the partition */
    uint16_t tlv_offset = 0;
    uint8_t latest_subtype = 0;
    esp_secure_cert_tlv_header_t *latest_tlv_header = NULL;
    bool read_latest_tlv = 0;

    if (subtype == ESP_SECURE_CERT_SUBTYPE_MAX) {
        read_latest_tlv = 1;
    }

    while (1) {
        esp_secure_cert_tlv_header_t *tlv_header = (esp_secure_cert_tlv_header_t *)(esp_secure_cert_addr + tlv_offset);
        ESP_LOGD(TAG, "Reading from offset of %d from base of esp_secure_cert", tlv_offset);
        if (tlv_header->magic != ESP_SECURE_CERT_TLV_MAGIC) {
            if (read_latest_tlv) {
                if (latest_tlv_header != NULL) {
                    // Verifying the latest TLV here because we only need to verify the last TLV entry of given subtype
                    // instead of all available entries of the given subtype
                    ESP_LOGD(TAG, "Verify integrity of latest tlv obtained of subtype = %d", latest_subtype);
                    if (esp_secure_cert_verify_tlv_integrity(latest_tlv_header)) {
                        ESP_LOGD(TAG, "tlv structure of type %d and subtype %d found and verified", type, latest_subtype);
                        *tlv_address = (void *)latest_tlv_header;
                        return ESP_OK;
                    } else {
                        return ESP_FAIL;
                    }
                }
            }
            if (type == ESP_SECURE_CERT_TLV_END) {
                /* The invalid magic means last tlv read successfully was the last valid tlv structure present,
                 * so send the end address of the tlv.
                 * This address can be used to add a new tlv structure. */
                *tlv_address = (void *)tlv_header;
                return ESP_OK;
            }
            ESP_LOGD(TAG, "Unable to find tlv of type: %d", type);
            ESP_LOGD(TAG, "Expected magic byte is %04X, obtained magic byte = %04X", ESP_SECURE_CERT_TLV_MAGIC, (unsigned int) tlv_header->magic);
            return ESP_FAIL;
        }

        if (((esp_secure_cert_tlv_type_t)tlv_header->type) == type) {
            if (read_latest_tlv) {
                ESP_LOGD(TAG, "TLV entry of type: %d and subtype:%d found", tlv_header->type, tlv_header->subtype);
                ESP_LOGD(TAG, "Continuing to find more recent entry of given subtype");
                latest_subtype = tlv_header->subtype;
                // Store the tlv address of the latest entry found with given type
                latest_tlv_header = (void *)tlv_header;
                // Dont stop here and keep traversing till last TLV entry
            } else {
                if (tlv_header->subtype == subtype) {
                    if (esp_secure_cert_verify_tlv_integrity(tlv_header)) {
                        ESP_LOGD(TAG, "tlv structure of type %d and subtype %d found and verified", type, subtype);
                        *tlv_address = (void *)tlv_header;
                        return ESP_OK;
                    } else {
                        return ESP_FAIL;
                    }
                }
            }
        }
        // Move the offset to the start of the next tlv entry
        tlv_offset = tlv_offset + esp_secure_cert_get_tlv_total_length(tlv_header);
    }
}

/**

@brief Retrieve the header of a specific ESP Secure Certificate TLV record.
This function retrieves the header of a specific ESP Secure Certificate TLV record, identified by the type parameter. The tlv_header parameter is a pointer to a buffer where the header will be stored. The function returns ESP_OK if the header is successfully retrieved, otherwise it returns an error code.
@param[in] type The type of the TLV record to retrieve the header for.
@param[out] tlv_header The pointer at this location shall be updated with tlv_header pointer value.
@return ESP_OK          Success
        ESP_FAIL/
        relevant error  Failure
*/
static esp_err_t esp_secure_cert_tlv_get_header(esp_secure_cert_tlv_type_t type, uint8_t subtype, esp_secure_cert_tlv_header_t **tlv_header)
{
    esp_err_t err = ESP_FAIL;
    char *esp_secure_cert_addr = (char *)esp_secure_cert_get_mapped_addr();
    if (esp_secure_cert_addr == NULL) {
        ESP_LOGE(TAG, "Error in obtaining esp_secure_cert memory mapped address");
        return ESP_FAIL;
    }
    err = esp_secure_cert_find_tlv(esp_secure_cert_addr, type, subtype, (void **)tlv_header);
    if (err != ESP_OK) {
        ESP_LOGD(TAG, "Could not find the tlv of type %d and subtype %d", type, subtype);
        return err;
    }
    return err;
}

esp_err_t esp_secure_cert_tlv_get_addr(esp_secure_cert_tlv_type_t type, esp_secure_cert_tlv_subtype_t subtype, char **buffer, uint32_t *len)
{
    esp_err_t err;
    esp_secure_cert_tlv_header_t *tlv_header = NULL;
    err = esp_secure_cert_tlv_get_header(type, (uint8_t)subtype, &tlv_header);
    if (err != ESP_OK) {
        ESP_LOGD(TAG, "Could not find header for TLV type %d and subtype %d", type, subtype);
        return err;
    }

    // Special case : We return the end address of the last
    // valid TLV in this case
    // and length is set to the total length of valid TLV entries
    if (type == ESP_SECURE_CERT_TLV_END) {
        *buffer = (char *)tlv_header;
        const void *esp_secure_cert_addr = esp_secure_cert_get_mapped_addr();
        *len = (void*)tlv_header - esp_secure_cert_addr;
        return ESP_OK;
    }

    *buffer = (char *)&tlv_header->value;
    *len = tlv_header->length;

