rednblkx/HomeKey-ESP32/managed_components/espressif__esp_secure_cert_mgr/srcs/esp_secure_cert_tlv_read.c
    if (ESP_SECURE_CERT_IS_TLV_ENCRYPTED(tlv_header->flags)) {
#if SOC_HMAC_SUPPORTED
        ESP_LOGD(TAG, "TLV data is encrypted");
        char *output_buf = (char *)heap_caps_calloc(1, sizeof(char) * (*len - HMAC_ENCRYPTION_TAG_LEN), MALLOC_CAP_INTERNAL);
        if (output_buf == NULL) {
            ESP_LOGE(TAG, "Failed to allocate memory");
            return ESP_ERR_NO_MEM;
        }

        err = esp_secure_cert_hmac_based_decryption(*buffer, *len, output_buf);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Failed to decrypt the data");
            free(output_buf);
            return err;
        }
        ESP_FAULT_ASSERT(err == ESP_OK);
        *buffer = output_buf;
        *len =  *len - HMAC_ENCRYPTION_TAG_LEN;
#else
        return ESP_ERR_NOT_SUPPORTED;
#endif
    } else if (ESP_SECURE_CERT_HMAC_ECDSA_KEY_DERIVATION(tlv_header->flags)) {
#if SOC_HMAC_SUPPORTED
        ESP_LOGD(TAG, "ECDSA private key shall be generated with help of HMAC");
        char *output_buf = (char *)heap_caps_calloc(1, sizeof(char) * (ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE), MALLOC_CAP_INTERNAL);
        if (output_buf == NULL) {
            ESP_LOGE(TAG, "Failed to allocate memory");
            return ESP_ERR_NO_MEM;
        }
        err = esp_secure_cert_gen_ecdsa_key(subtype, output_buf, ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE);
        if (err != ESP_OK) {
            free(output_buf);
            ESP_LOGE(TAG, "Failed to generate ECDSA key, returned %04X", err);
            return ESP_FAIL;
        }
        ESP_FAULT_ASSERT(err == ESP_OK);
        *buffer = output_buf;
        *len = ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE;
#else
        return ESP_ERR_NOT_SUPPORTED;
#endif
    } else {
        ESP_LOGD(TAG, "TLV data is not encrypted");
    }
    return ESP_OK;
}

esp_err_t esp_secure_cert_get_tlv_info(esp_secure_cert_tlv_config_t *tlv_config, esp_secure_cert_tlv_info_t *tlv_info)
{
    if (tlv_config == NULL || tlv_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    memset(tlv_info, 0, sizeof(esp_secure_cert_tlv_info_t));
    esp_err_t esp_ret;

    esp_secure_cert_tlv_header_t *tlv_header = NULL;

    // Try to obtain the TLV header
    esp_ret = esp_secure_cert_tlv_get_header(tlv_config->type, tlv_config->subtype, &tlv_header);
    if (esp_ret != ESP_OK) {
        return esp_ret;
    }

    // Try to obtain the TLV data
    esp_ret = esp_secure_cert_tlv_get_addr(tlv_config->type, tlv_config->subtype, &tlv_info->data, &tlv_info->length);
    if (esp_ret != ESP_OK) {
        tlv_info->data = NULL;
        tlv_info->length = 0;
        return esp_ret;
    }

    // Everything successfully obtained, copy to output tlv_info
    tlv_info->type = tlv_header->type;
    tlv_info->subtype = tlv_header->subtype;
    tlv_info->flags = tlv_header->flags;

    // Special case
    if (tlv_info->type == ESP_SECURE_CERT_TLV_END) {
        // In this case the user is requesting the end address
        // of the TLV entries, invalidate the subtype field
        // in the tlv_info struct
        tlv_info->subtype = ESP_SECURE_CERT_SUBTYPE_INVALID;
    }
    return esp_ret;
}

esp_err_t esp_secure_cert_free_tlv_info(esp_secure_cert_tlv_info_t *tlv_info)
{
    if (tlv_info) {
        if (!esp_ptr_in_drom((const void *) tlv_info->data)) {
            /* Free the buffer only if it is not from the drom section */
            free(tlv_info->data);
        }
    }
    return ESP_OK;
}

esp_err_t esp_secure_cert_iterate_to_next_tlv(esp_secure_cert_tlv_iterator_t *tlv_iterator)
{
    if (tlv_iterator == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_secure_cert_tlv_header_t *tlv_header = (esp_secure_cert_tlv_header_t *)tlv_iterator->iterator;
    if (tlv_header == NULL) {
        ESP_LOGD(TAG, "tlv_header value is NULL, finding the first TLV entry");
        tlv_header = (esp_secure_cert_tlv_header_t *) esp_secure_cert_get_mapped_addr();
        // Verify the TLV entry integrity before returning
        if (esp_secure_cert_verify_tlv_integrity(tlv_header)) {
            tlv_iterator->iterator = (void*)tlv_header;
            return ESP_OK;
        } else {
            ESP_LOGI(TAG, "The esp_secure_cert partition does not appear to be valid");
            return ESP_FAIL;
        }
    }

    // Verify the current TLV entry integrity
    if (!esp_secure_cert_verify_tlv_integrity(tlv_header)) {
        ESP_LOGE(TAG, "Invalid iterator value provided");
        return ESP_FAIL;
    }

    // Move to the next TLV entry
    tlv_header = ((void*) tlv_header + esp_secure_cert_get_tlv_total_length(tlv_header));
    if (esp_secure_cert_verify_tlv_integrity(tlv_header)) {
        // Verify the TLV entry integrity before returning
        tlv_iterator->iterator = (void*)tlv_header;
        return ESP_OK;
    }

    // We shall come here if the integrity verification
    // fails above, this means no more valid TLV entries
    ESP_LOGD(TAG, "Iterator is at the last TLV entry");
    // Keeping the log level as debug as this
    // is acceptable failure in some cases
    return ESP_FAIL;
}

esp_err_t esp_secure_cert_get_tlv_info_from_iterator(esp_secure_cert_tlv_iterator_t *tlv_iterator, esp_secure_cert_tlv_info_t *tlv_info)
{
    if (tlv_iterator == NULL || tlv_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_secure_cert_tlv_header_t *tlv_header = (esp_secure_cert_tlv_header_t*)tlv_iterator->iterator;
    if (!esp_secure_cert_verify_tlv_integrity(tlv_header)) {
        ESP_LOGE(TAG, "Iterator does not point to a valid TLV entry");
        return ESP_ERR_INVALID_ARG;
    }

    esp_secure_cert_tlv_config_t tlv_config = {};
    tlv_config.type = tlv_header->type;
    tlv_config.subtype = tlv_header->subtype;
    return esp_secure_cert_get_tlv_info(&tlv_config, tlv_info);
}

static void esp_secure_cert_print_tlv_info(esp_secure_cert_tlv_info_t *tlv_info)
{
    if (tlv_info != NULL) {
        ESP_LOGI(TAG, "Type: %d, Subtype: %d, Data length: %"PRIu32"", tlv_info->type, tlv_info->subtype, tlv_info->length);
        ESP_LOGI(TAG, "Flags: %X", tlv_info->flags);
    }
}

void esp_secure_cert_list_tlv_entries(void)
{
    esp_secure_cert_tlv_iterator_t tlv_iterator = {};
    size_t count = 0;
    while (esp_secure_cert_iterate_to_next_tlv(&tlv_iterator) == ESP_OK) {
        esp_secure_cert_tlv_info_t tlv_info;
        if (esp_secure_cert_get_tlv_info_from_iterator(&tlv_iterator, &tlv_info) == ESP_OK) {
            count++;
            printf("\n");
            ESP_LOGI(TAG, "TLV Entry No: %d", count);
            esp_secure_cert_print_tlv_info(&tlv_info);
        }
    }
}

#if SOC_HMAC_SUPPORTED
esp_err_t esp_secure_cert_calculate_hmac_encryption_iv(uint8_t *iv)
{
    if (iv == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    const uint32_t iv_message[HMAC_ENCRYPTION_MESSAGE_LEN / 4] = {[0 ... 7] = 0xABCDABCD};
    esp_err_t esp_ret = ESP_FAIL;
    esp_efuse_block_t efuse_block = EFUSE_BLK_MAX;
    if (!esp_efuse_find_purpose(ESP_EFUSE_KEY_PURPOSE_HMAC_UP, &efuse_block)) {
        ESP_LOGE(TAG, "Failed to get the block with purpose set to HMAC_UP");
        return ESP_FAIL;;
    }

    hmac_key_id_t hmac_key_id = efuse_block - (int)EFUSE_BLK_KEY0;
    uint8_t hmac[HMAC_ENCRYPTION_AES_GCM_KEY_LEN];
    esp_ret = esp_hmac_calculate(hmac_key_id, (uint8_t *)iv_message, HMAC_ENCRYPTION_MESSAGE_LEN, hmac);
    if (esp_ret != ESP_OK) {
        ESP_LOGE(TAG, "Could not calculate the HMAC value, returned %04X", esp_ret);
        ESP_LOGE(TAG, "returned %04X", esp_ret);
        return esp_ret;
    }
    memcpy(iv, hmac, HMAC_ENCRYPTION_IV_LEN);
    return ESP_OK;
}

esp_err_t esp_secure_cert_calculate_hmac_encryption_key(uint8_t *aes_key)
{
    if (aes_key == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    const uint32_t key_message[HMAC_ENCRYPTION_MESSAGE_LEN / 4] = {[0 ... 7] = 0xFFFFFFFF};
    esp_err_t esp_ret = ESP_FAIL;
    esp_efuse_block_t efuse_block = EFUSE_BLK_MAX;
    if (!esp_efuse_find_purpose(ESP_EFUSE_KEY_PURPOSE_HMAC_UP, &efuse_block)) {
        ESP_LOGE(TAG, "Failed to get the block with purpose set to HMAC_UP");
        return ESP_FAIL;;
    }

    hmac_key_id_t hmac_key_id = efuse_block - (int)EFUSE_BLK_KEY0;
    esp_ret = esp_hmac_calculate(hmac_key_id, (uint8_t *)key_message, HMAC_ENCRYPTION_MESSAGE_LEN, aes_key);
    if (esp_ret != ESP_OK) {
        ESP_LOGE(TAG, "Could not calculate the HMAC value, returned %04X", esp_ret);
        return esp_ret;
    }
    return ESP_OK;
}

#define HMAC_ENCRYPTION_RANDOM_DELAY_LIMIT 100
/*
 * @info
 * Decrypt the data encrypted using hmac based encryption
 *
 * in_buf       This is a pointer in flash that points to the encrypted data
 * len          Length of the encrypted data
 * output_buf   Buffer to write the decrypted data
 *              This must be of size = len - HMAC_ENCRYPTION_TAG_LEN
 */
static esp_err_t esp_secure_cert_hmac_based_decryption(char *in_buf, uint32_t len, char *output_buf)
{
    esp_err_t esp_ret = ESP_FAIL;
    int ret = -1;
    uint8_t aes_gcm_key[HMAC_ENCRYPTION_AES_GCM_KEY_LEN];
    uint8_t iv[HMAC_ENCRYPTION_IV_LEN];

