rednblkx/HomeKey-ESP32/managed_components/espressif__esp_secure_cert_mgr/srcs/esp_secure_cert_tlv_read.c
    esp_ret = esp_secure_cert_calculate_hmac_encryption_iv(iv);
    if (esp_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to calculate hmac encryption iv");
        return esp_ret;
    }
    esp_ret = esp_secure_cert_calculate_hmac_encryption_key(aes_gcm_key);
    if (esp_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to calculate hmac encryption key");
        return esp_ret;
    }

    mbedtls_gcm_context gcm_ctx;
    mbedtls_gcm_init(&gcm_ctx);
    ret = mbedtls_gcm_setkey(&gcm_ctx, MBEDTLS_CIPHER_ID_AES, (unsigned char *)aes_gcm_key, HMAC_ENCRYPTION_AES_GCM_KEY_LEN * 8);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failure at mbedtls_gcm_setkey with error code : -0x%04X", -ret);
        mbedtls_gcm_free(&gcm_ctx);
        return ESP_FAIL;
    }

    uint32_t rand_delay;
    rand_delay = esp_random() % HMAC_ENCRYPTION_RANDOM_DELAY_LIMIT;
    esp_rom_delay_us(rand_delay);

    len = len - HMAC_ENCRYPTION_TAG_LEN;
    ret = mbedtls_gcm_auth_decrypt(&gcm_ctx, len, iv,
                                   HMAC_ENCRYPTION_IV_LEN, NULL, 0,
                                   (unsigned char *) (in_buf + len),
                                   HMAC_ENCRYPTION_TAG_LEN,
                                   (const unsigned char *)(in_buf),
                                   (unsigned char *)output_buf);

    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to decrypt the data, mbedtls_gcm_crypt_and_tag returned %02X", ret);
        mbedtls_gcm_free(&gcm_ctx);
        return ESP_FAIL;
    }

    ESP_FAULT_ASSERT(ret == ESP_OK);

    return ESP_OK;
}

static int myrand(void *rng_state, unsigned char *output, size_t len)
{
    size_t olen;
    (void) olen;
    return mbedtls_hardware_poll(rng_state, output, len, &olen);
}

/*
 * The API converts the 256 bit ECDSA key to DER format.
 * @input
 * key_buf      The readable buffer containing the plaintext key
 * key_buf_len  The length of the key buf in bytes
 * output_buf   The writable buffer to write the DER key
 * output_buf_len Length of the output buffer
 *
 */
static esp_err_t esp_secure_cert_convert_key_to_der(char *key_buf, size_t key_buf_len, char* output_buf, size_t output_buf_len)
{
    esp_err_t ret = ESP_FAIL;
    // Convert the private key to der
    mbedtls_pk_context key;
    mbedtls_pk_init(&key);
    ret = mbedtls_pk_setup(&key, mbedtls_pk_info_from_type(MBEDTLS_PK_ECKEY));
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to setup pk key, returned %04X", ret);
        goto exit;
    }

    mbedtls_ecdsa_context *key_ctx = mbedtls_pk_ec(key);
    ret = mbedtls_ecp_group_load(&key_ctx->MBEDTLS_PRIVATE(grp), MBEDTLS_ECP_DP_SECP256R1);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to load the ecp group, returned %04X", ret);
        goto exit;
    }

    ret = mbedtls_mpi_read_binary(&key_ctx->MBEDTLS_PRIVATE(d), (const unsigned char *) key_buf, key_buf_len);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to read binary, returned %04X", ret);
        goto exit;
    }

    // Calculate the public key
    ret = mbedtls_ecp_mul(&key_ctx->MBEDTLS_PRIVATE(grp), &key_ctx->MBEDTLS_PRIVATE(Q), &key_ctx->MBEDTLS_PRIVATE(d), &key_ctx->MBEDTLS_PRIVATE(grp).G, myrand, NULL);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to generate public key, returned %04X", ret);
        goto exit;
    }

    // Write the private key in DER format
    ret = mbedtls_pk_write_key_der(&key, (unsigned char *) output_buf, output_buf_len);
    if (ret != ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE) {
        ESP_LOGE(TAG, "Failed to write the pem key, returned %04X", ret);
        goto exit;
    }
    ret = ESP_OK;

exit:
    mbedtls_pk_free(&key);
    return ret;
}
/*
 * @info
 * Generate the ECDSA private key (DER format) with help of the PBKDF2 hmac implementation.
 * In this case the first eFuse key block with purpose set to HMAC_UP shall be used for generating the private key.
 * The key shall be generated for the SECP256R1 curve, the length of the key in DER format shall be ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE bytes.
 * The API assumes that a valid salt is stored in the esp_secure_cert partition, Otherwise the API would return with failure.
 *
 * @input
 * output_buf  A writable buffer to store the DER formatted ECDSA private key
 * buf_len     The length of the buffer in bytes. This must be exactly ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE bytes.
 *
 */
static esp_err_t esp_secure_cert_gen_ecdsa_key(esp_secure_cert_tlv_subtype_t subtype, char *output_buf, size_t buf_len)
{
    esp_err_t err = ESP_FAIL;
    int ret = 0;
    if (buf_len != ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE) {
        return ESP_ERR_INVALID_ARG;
    }

    // Obtain the salt stored in the esp_secure_cert partition
    uint8_t *salt = NULL;
    uint32_t salt_len = 0;
    err = esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_HMAC_ECDSA_KEY_SALT, subtype, (void *)&salt, &salt_len);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error in reading salt, returned %04X", err);
    }
    ESP_FAULT_ASSERT(err == ESP_OK);

    ESP_LOG_BUFFER_HEX_LEVEL("SALT", salt, salt_len, ESP_LOG_DEBUG);

    esp_efuse_block_t efuse_block = EFUSE_BLK_KEY_MAX;
    bool res = esp_efuse_find_purpose(ESP_EFUSE_KEY_PURPOSE_HMAC_UP, &efuse_block);
    if (!res) {
        ESP_LOGE(TAG, "Failed to get the block with purpose set to HMAC_UP");
        return ESP_FAIL;
    }
    ESP_FAULT_ASSERT(res);

    // Allocate memory for private key
    char *key_buf = (char *)heap_caps_calloc(1, sizeof(char) * (ESP_SECURE_CERT_DERIVED_ECDSA_KEY_SIZE), MALLOC_CAP_INTERNAL);
    if (key_buf == NULL) {
        ESP_LOGE(TAG, "Failed to allocate memory");
        return ESP_ERR_NO_MEM;
    }

    // Generate the private key
    ret = esp_pbkdf2_hmac_sha256(efuse_block - (int)EFUSE_BLK_KEY0, salt, salt_len, ESP_SECURE_CERT_KEY_DERIVATION_ITERATION_COUNT, ESP_SECURE_CERT_DERIVED_ECDSA_KEY_SIZE, (unsigned char *)key_buf);
    if (ret != 0) {
        ESP_LOGE(TAG, "Failed to derive the ECDSA key using HMAC, returned %04X", ret);
        free(key_buf);
        return ESP_FAIL;
    }
    ESP_FAULT_ASSERT(ret == 0);

    err = esp_secure_cert_convert_key_to_der(key_buf, ESP_SECURE_CERT_DERIVED_ECDSA_KEY_SIZE, output_buf, ESP_SECURE_CERT_ECDSA_DER_KEY_SIZE);
    if (err != ESP_OK) {
        free(key_buf);
        free(output_buf);
        ESP_LOGE(TAG, "Failed to convert the plaintext key to DER format");
        return ESP_FAIL;
    }
    // Free the plaintext private key as it is no longer needed
    free(key_buf);
    return ESP_OK;
}
#endif

