rednblkx/HomeKey-ESP32/managed_components/espressif__esp_secure_cert_mgr/srcs/esp_secure_cert_tlv_read.c
#ifdef CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL
esp_ds_data_ctx_t *esp_secure_cert_tlv_get_ds_ctx(void)
{
    esp_err_t esp_ret;
    esp_ds_data_ctx_t *ds_data_ctx;

    ds_data_ctx = (esp_ds_data_ctx_t *)calloc(1, sizeof(esp_ds_data_ctx_t));
    if (ds_data_ctx == NULL) {
        ESP_LOGE(TAG, "Error in allocating memory for esp_ds_data_context");
        goto exit;
    }

    uint32_t len;
    esp_ds_data_t *esp_ds_data;
    esp_ret = esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_DS_DATA_TLV, ESP_SECURE_CERT_SUBTYPE_0, (void *) &esp_ds_data, &len);
    if (esp_ret != ESP_OK) {
        ESP_LOGE(TAG, "Error in reading ds_data, returned %04X", esp_ret);
        goto exit;
    }

    esp_ds_data_ctx_t *ds_data_ctx_flash;
    esp_ret = esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_DS_CONTEXT_TLV, 0, (void *) &ds_data_ctx_flash, &len);
    memcpy(ds_data_ctx, ds_data_ctx_flash, len);
    ds_data_ctx->esp_ds_data = esp_ds_data;
    if (esp_ret != ESP_OK) {
        ESP_LOGE(TAG, "Error in reading ds_context, returned %04X", esp_ret);
        goto exit;
    }
    return ds_data_ctx;
exit:
    free(ds_data_ctx);
    return NULL;
}

void esp_secure_cert_tlv_free_ds_ctx(esp_ds_data_ctx_t *ds_ctx)
{
    free(ds_ctx);
}
#endif /* CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL */

bool esp_secure_cert_is_tlv_partition(void)
{
    char *esp_secure_cert_addr = (char *)esp_secure_cert_get_mapped_addr();
    if (esp_secure_cert_addr == NULL) {
        return 0;
    }
    esp_secure_cert_tlv_header_t *tlv_header = (esp_secure_cert_tlv_header_t *)(esp_secure_cert_addr );
    if (tlv_header->magic == ESP_SECURE_CERT_TLV_MAGIC) {
        ESP_LOGD(TAG, "TLV partition identified");
        return 1;
    }
    return 0;
}

#ifndef CONFIG_ESP_SECURE_CERT_SUPPORT_LEGACY_FORMATS
esp_err_t esp_secure_cert_get_device_cert(char **buffer, uint32_t *len)
{
    return esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_DEV_CERT_TLV, ESP_SECURE_CERT_SUBTYPE_0, buffer, len);
}

esp_err_t esp_secure_cert_free_device_cert(char *buffer)
{
    (void) buffer; /* nothing to do */
    return ESP_OK;
}

esp_err_t esp_secure_cert_get_ca_cert(char **buffer, uint32_t *len)
{
    return esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_CA_CERT_TLV, ESP_SECURE_CERT_SUBTYPE_0, buffer, len);
}

esp_err_t esp_secure_cert_free_ca_cert(char *buffer)
{
    (void) buffer; /* nothing to do */
    return ESP_OK;
}

#ifndef CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL
esp_err_t esp_secure_cert_get_priv_key(char **buffer, uint32_t *len)
{
    return esp_secure_cert_tlv_get_addr(ESP_SECURE_CERT_PRIV_KEY_TLV, ESP_SECURE_CERT_SUBTYPE_0, buffer, len);
}

esp_err_t esp_secure_cert_free_priv_key(char *buffer)
{
    if (!esp_ptr_in_drom((const void *) buffer)) {
        free(buffer);
        return ESP_OK;
    }
    (void) buffer; /* nothing to do */
    return ESP_OK;
}

#else /* !CONFIG_ESP_SECURE_CERT_DS_PEIPHERAL */

esp_ds_data_ctx_t *esp_secure_cert_get_ds_ctx(void)
{
    return esp_secure_cert_tlv_get_ds_ctx();
}

void esp_secure_cert_free_ds_ctx(esp_ds_data_ctx_t *ds_ctx)
{
    esp_secure_cert_tlv_free_ds_ctx(ds_ctx);
}
#endif /* CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL */

esp_err_t esp_secure_cert_get_priv_key_type(esp_secure_cert_key_type_t *priv_key_type) {
    esp_err_t err;
    if (priv_key_type == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_secure_cert_tlv_header_t *tlv_header = NULL;
    err = esp_secure_cert_tlv_get_header(ESP_SECURE_CERT_PRIV_KEY_TLV, 0, &tlv_header);
    if (err != ESP_OK) {
        *priv_key_type = ESP_SECURE_CERT_INVALID_KEY;
        ESP_LOGE(TAG, "Could not find header for priv key");
        return err;
    }

    if (ESP_SECURE_CERT_HMAC_ECDSA_KEY_DERIVATION(tlv_header->flags)) {
        *priv_key_type = ESP_SECURE_CERT_HMAC_DERIVED_ECDSA_KEY;
    } else if (ESP_SECURE_CERT_KEY_ECDSA_PERIPHERAL(tlv_header->flags)) {
        *priv_key_type = ESP_SECURE_CERT_ECDSA_PERIPHERAL_KEY;
    } else if (ESP_SECURE_CERT_IS_TLV_ENCRYPTED(tlv_header->flags)) {
        *priv_key_type = ESP_SECURE_CERT_HMAC_ENCRYPTED_KEY;
    } else {
        *priv_key_type = ESP_SECURE_CERT_DEFAULT_FORMAT_KEY;
    }
    return ESP_OK;
}

esp_err_t esp_secure_cert_get_priv_key_efuse_id(uint8_t *efuse_block_id) {
    esp_err_t err;
    esp_secure_cert_tlv_header_t *tlv_header = NULL;
    if (efuse_block_id == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    err = esp_secure_cert_tlv_get_header(ESP_SECURE_CERT_TLV_SEC_CFG, 0,  &tlv_header);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Could not find header for TLV security configurations");
        return ESP_ERR_NOT_SUPPORTED;
    }

    esp_secure_cert_tlv_sec_cfg_t *tlv_sec_cfg;
    tlv_sec_cfg = (esp_secure_cert_tlv_sec_cfg_t *) tlv_header->value;
    *efuse_block_id = tlv_sec_cfg->priv_key_efuse_id;

    return ESP_OK;
}
#endif /* CONFIG_ESP_SECURE_CERT_SUPPORT_LEGACY_FORMATS */
